cask_args appdir: '/Applications'

# Tap Repo

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'

brew 'ack'
brew 'fzf'
brew 'go'
brew 'git'
brew 'httpie'
brew 'libcouchbase'
brew 'mackup'
brew 'nvim'
brew 'nvm'
brew 'pipenv'
brew 'postgresql'
brew 'pyenv'
brew 'rbenv-bundler'
brew 'rbenv'
brew 'ruby-build'
brew 'rust'
brew 'tree'
brew 'unar'
brew 'wget'
brew 'zsh'

cask 'alfred'
cask 'caffeine'
cask 'daisydisk'
cask 'dbeaver-community'
cask 'docker'
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'hammerspoon'
# cask 'kite'
cask 'macdown'
cask 'postman'
cask 'karabiner-elements'
cask 'quicklook-json'  # Quick Look Plugins (https://github.com/sindresorhus/quick-look-plugins)
cask 'slack'
cask 'sourcetree'
cask 'the-unarchiver'
cask 'scroll-reverser'
cask 'dozer'