cask_args appdir: '/Applications'

# Tap Repo
tap 'caskroom/versions'
tap 'caskroom/cask'
tap 'homebrew/cask-fonts'

brew 'ack'
brew 'fzf'
brew 'git'
brew 'httpie'
brew 'libcouchbase'
brew 'mackup'
brew 'nvim'
brew 'nvm'
brew 'pipenv'
brew 'postgresql'
brew 'pyenv'
brew 'rbenv-bundler'
brew 'rbenv'
brew 'ruby-build'
brew 'rust'
brew 'tree'
brew 'unar'
brew 'wget'
brew 'zsh'

cask 'alfred'
cask 'caffeine'
cask 'daisydisk'
cask 'dash'
cask 'dbeaver-community'
cask 'docker'
cask 'dropbox'
cask 'flux'
cask 'font-fira-code'
cask 'font-hack-nerd-font'
cask 'forticlient'
cask 'google-chrome-canary'
cask 'google-chrome'
cask 'hammerspoon'
cask 'iterm2'
cask 'kaleidoscope'
cask 'kite'
cask 'macdown'
cask 'postman'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlstephen'
cask 'qlvideo'
cask 'quicklook-json'  # Quick Look Plugins (https://github.com/sindresorhus/quick-look-plugins)
cask 'slack'
cask 'sourcetree'
cask 'sublime-text'
cask 'suspicious-package'
cask 'the-unarchiver'
cask 'visual-studio-code'
cask 'webpquicklook'
cask 'scroll-reverser'

# cask 'docker-toolbox'
